// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19] 
// 6, 1, 33 -> [6, 1, 33]

int[] array = {18, 62, 43, 24, 65, 68, 47, 18};

int n = array.Length;
for (int i = 0; i < n; i++)
{
    Console.Write(array[i] + ";");
}




